Revit 2027 API
BuiltInFailures.StairRampFailures.StairStringerCantOffset Property
 Inside stringer could not be created because of insufficient space. Please disable the inside stringer or decrease its width.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairStringerCantOffset { get; }
Public Shared ReadOnly Property StairStringerCantOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairStringerCantOffset {
	FailureDefinitionId^ get ();
}
static member StairStringerCantOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace